# GroupCannotMixBackAndForegroundDetail Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..GroupCannotMixBackAndForegroundDetail Property
BuiltInFailures..::..GroupFailures Class See Also
---
This detail group contains some elements which display in the background and some which display in the foreground. Detail groups must be able to be displayed as a unit in either the foreground or background, so this type of mixture is not allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GroupCannotMixBackAndForegroundDetail { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GroupCannotMixBackAndForegroundDetail As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GroupCannotMixBackAndForegroundDetail {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace